export const dummyStart = {
  content:
    "환경 문제에 대한 여정을 시작합니다. 여러 이벤트를 통해 환경에 긍정적인 변화를 가져오는 선택을 하게 될 것입니다.",
};

export const dummyEmails = [
  {
    id: 1,
    title: "지구를 지키는 첫 걸음",
    content: "앗, ^오존층^이 뭘까요? 그럼 ^지구온난화^는 뭔가요?",
    writer: "환경부",
  },
  {
    id: 2,
    title: "에너지 절약 캠페인",
    content: "모두가 함께 실천하는 에너지 절약!",
    writer: "환경부",
  },
  {
    id: 3,
    title: "탄소 중립 회의 초대",
    content: "회의 일정: 내일 오후 3시, 장소: 본부 회의실",
    writer: "환경부",
  },
  {
    id: 4,
    title: "도시 생태계 회복을 위한 정원 조성 제안",
    content:
      "최근 도시 내 생물다양성 감소와 대기질 악화가 동시에 관찰되고 있습니다. 이에 따라 저희 연구팀은 도심 곳곳에 정원을 조성하여 ^도시생태계^ 회복을 유도하는 프로젝트를 제안드립니다. ^도시생태계^는 인공 구조물과 자연 요소가 공존하는 복합적 생태계로, 이 균형이 무너지면 탄소순환과 종다양성 유지에 큰 위협이 됩니다.",
    writer: "김세진 생명공학자",
  },
];

export const dummyNews = [
  {
    id: 1,
    title: "기후 변화 비상",
    content: "지구 온도가 역대 최고치를 기록했습니다.",
  },
  { id: 2, title: "태풍 접근 중", content: "남부 지역 태풍 대비 안내." },
  {
    id: 3,
    title: "테스트를 위해 긴 뉴스 제목이 필요하다 그러니 나는",
    content: "내용없음",
  },
  {
    id: 4,
    title: "도심 하천에 번진 초록 독성물",
    content:
      "서울 ○○구 도심 하천에서 정체불명의 녹색 침전물이 발견되며 수십 마리의 물고기가 폐사했습니다. 환경감시단은 독성 녹조로 판단하며 시민 불안이 커지고 있습니다.",
  },
];

export const dummyTooltip: Record<string, string> = {
  오존층: "오존층은 지구 대기의 일부로 자외선을 차단합니다.",
  지구온난화: "지구 평균 기온이 상승하는 현상입니다.",
  도시생태계:
    "인간의 거주 환경과 자연 요소가 혼합된 도시 내 생태계. 녹지, 하천, 공원 등이 주요 요소이며 생물 다양성과 탄소 순환에 영향을 미친다.",
};
